snlkuharlocal/src/Documents/ЗаказКлиентаFBS/ЗаказКлиентаFBS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиентаFBS</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛистПереукладки</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрефиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуффиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РИД</name>
      <comment>идентификатор вайлдб. для обмена.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусWB</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказа</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеУКлиента</name>
      <type>
        <types>CatalogRef.СостояниеНакладнойУКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>АртикулКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтменаОтработана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрэкНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛогистСервис</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркОфис</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркСклад</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПереданоНаСайт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЗаказКлиентаFBS/Forms/ФормаДокументаУпр/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	ИмяКолонки = Элемент.ТекущийЭлемент.Имя;
	
	Если ИмяКолонки <> "Отменен" И ИмяКолонки <> "ВычеркСклад"
		И ИмяКолонки <> "ВычеркОфис" И ИмяКолонки <> "ПереданоНаСайт" Тогда
		Возврат;
	КонецЕсли;
	
	СообщениеПользователю = ТоварыПриОкончанииРедактированияНаСервере(Объект.Ссылка, ТекущаяСтрока[ИмяКолонки],
		ИмяКолонки, Элемент.Имя, ТекущаяСтрока.НомерЗаказа);
	Если ЗначениеЗаполнено(СообщениеПользователю) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СообщениеПользователю;
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Товары при окончании редактирования на сервере.
&НаСервере
Функция ТоварыПриОкончанииРедактированияНаСервере(Ссылка, ДанныеТекущейКолонки, ИмяКолонки, // ИмяТабличнойЧасти...)
	ИмяТабличнойЧасти, НомерЗаказа)
	
	ТабличнаяЧастьТовары = ЗначенияРеквизитовОбъекта(Ссылка, ИмяТабличнойЧасти)[ИмяТабличнойЧасти].Выгрузить();
	
	СтрокаТабличнойЧасти = ТабличнаяЧастьТовары.Найти(НомерЗаказа, "НомерЗаказа");
	Если ДанныеТекущейКолонки <> СтрокаТабличнойЧасти[ИмяКолонки]
		И ИмяКолонки = "Отменен" Тогда
		ДанныеТекущейКолонки = СтрокаТабличнойЧасти[ИмяКолонки];
		
		Возврат "Запрещено устанавливать признак отмены интерактивно!
		|Для установки признака вычерка используйте поле ВычеркСклад.
		|Для применения изменений используйте кнопку ""Заполнить по заказу клиента FBS"" на форме РНК.
		|";
	ИначеЕсли ДанныеТекущейКолонки <> СтрокаТабличнойЧасти[ИмяКолонки]
		И (ИмяКолонки = "ВычеркСклад" Или ИмяКолонки = "ВычеркОфис")
		И СтрокаТабличнойЧасти.Отменен Тогда
		ДанныеТекущейКолонки = СтрокаТабличнойЧасти[ИмяКолонки];
		
		Возврат "Данный заказ уже отменен!
		|Нельзя изменять признак вычерка для заказа, по которому уже была выполнена отмена!
		|";
	ИначеЕсли ДанныеТекущейКолонки <> СтрокаТабличнойЧасти[ИмяКолонки]
		И ИмяКолонки = "ПереданоНаСайт" Тогда
		ДанныеТекущейКолонки = СтрокаТабличнойЧасти[ИмяКолонки];
		
		Возврат "Нельзя изменить значение служебного поля!
		|Признак ""Передано на сайт"" необходим для правильной отмены товара на сайте.
		|Значением этого поля управляет пользователь Automat.
		|";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции // ТоварыПриОкончанииРедактированияНаСервере()

#КонецОбласти
